var pic9_20b_x=[239,248,260,220,240,260,206,230,192,220,260,175,192,220,260,160,175,200,255,120,180,220,245,112,140,180,230,95,100,110,120,140,160,200,76,90,100,120,140,190,50,80,120,168,40,100,161,62,80,120,140,45,60,100,120,120,110,100,60,42,60,70,85,100,100,80,60];
var pic9_20b_y=[0.0,1.0,1.9,0.0,2.0,3.2,0.0,2.5,0.0,3.0,5.9,0.0,2.0,4.2,6.9,0.0,2.0,4.0,8.0,0.0,4.0,6.0,8.0,0.0,2.9,5.0,8.0,0.0,1.0,2.5,3.0,4.1,5.0,7.0,0.0,2.2,3.0,4.1,5.0,8.0,0.0,3.0,5.0,8.0,1.8,4.8,8.0,2.8,3.9,4.3,6.5,4.0,3.8,5.0,6.6,7.4,7.8,7.8,6.2,4.5,4.8,4.5,5.0,5.9,6.2,6.1,5.0];
var pic9_20b_z=[-80,-80,-80,-70,-70,-70,-60,-60,-50,-50,-50,-40,-40,-40,-40,-30,-30,-30,-30,-20,-20,-20,-20,-10,-10,-10,-10, 0,0,0,0,0,0,0,0, 10,10,10,10,10,10,20,20,20,20,30,30,30,30,30,30,30,40,40,40,40,40,40,40,40,40,50,50,50,50,50,50];

var pic9_20a_x=[200.0,220.0,240.0,190.0,210.0,240.0,178.0,200.0,240.0,162.0,190.0,240.0,150.0,160.0,195.0,240.0,127.0,140.0,180.0,240.0,105.0,120.0,160.0,240.0,80.0,120.0,180.0,240.0,60.0,105.0,180.0,228.0,40.0,100.0,160.0,220.0,70.0,35.0,1.5,20.0,40.0,60.0,100.0,160.0,225.0,122.0,80.0,60.0,70.0,80.0,120.0,194.0,142.0,120.0,100.0,95.0,100.0,140.0,160.0,180.0,150.0,140.0,120.0,111.0,120.0,140.0,154.0];
var pic9_20a_y=[0.0,1.8,3.15,0.0,2.0,4.0,0.0,2.5,4.8,0.0,3.0,5.4,0.0,2.0,4.0,6.0,0.0,1.9,4.1,6.8,0.0,2.0,4.0,7.2,0.0,3.0,5.5,7.8,0.0,3.0,5.9,8.0,0.0,3.2,5.5,8.0,8.0,6.0,4.3,3.5,3.2,3.25,4.0,5.9,8.0,8.0,6.4,5.2,4.55,4.5,5.0,8.0,8.0,7.1,6.2,5.6,5.2,5.8,6.5,8.0,7.2,7.1,6.45,5.8,5.65,6.0,7.0];
var pic9_20a_z=[-80,-80,-80,-70,-70,-70,-60,-60,-60,-50,-50,-50,-40,-40,-40,-40,-30,-30,-30,-30,-20,-20,-20,-20,-10,-10,-10,-10,0,0,0,0,10,10,10,10,20,20,20,20,20,20,20,20,20,30,30,30,30,30,30,30,40,40,40,40,40,40,40,40,50,50,50,50,50,50,50];

var pic9_19b_x=[145,180,240,96,160,240,60,140,240,60,80,100,120,160,240,60,80,100,120,140,160,180,240,60,80,100,130,160,200,240,60,80,100,140,160,200,240,95,160,240,152,200,240];

var pic9_19b_y=[-5,-4,-3,-5,-3,-2,-4.7,-2.1,-1,-2,-1.6,-1.2,-1,-0.7,-0.3,0,0,0,0,0,0,0,0,2.0,1.6,1.1,0.8,0.5,0.4,0.3,4.8,4.0,3.0,2.0,1.7,1.2,1.0,5,2.7,2,5,3.2,3];

var pic9_19b_z=[-4,-4,-4,-3,-3,-3,-2,-2,-2,-1,-1,-1,-1,-1,-1,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,2,2,2,2,2,2,2,3,3,3,4,4,4];

var pic9_19a_x=[140,180,240,92,160,240,60,80,100,120,140,240,60,80,100,120,140,160,180,200,240,60,100,120,140,160,180,200,220,240,60,80,100,120,140,160,180,200,240,60,80,100,120,140,160,200,240,93,160,240,148,180,240];
var pic9_19a_y=[-5,-3.8,-3,-5,-3.1,-2,-4.8,-4,-3,-2.6,-2.1,-1,-2,-1.5,-1.2,-1,-0.8,-0.5,-0.25,-0.2,-0.2,0,0,0,0,0,0,0,0,0,2,1.6,1.2,0.9,0.75,0.5,0.25,0.2,0.2,4.8,3.9,3.0,2.5,2,1.7,1.2,1,5,2.9,2,5,3.6,3];
var pic9_19a_z=[-4,-4,-4,-3,-3,-3,-2,-2,-2,-2,-2,-2,-1,-1,-1,-1,-1,-1,-1,-1,-1,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,3,3,3,4,4,4];

function badvalue()
{
  return -9999;
}
function nodata()
{
  return "Нет данных";
}
function emptyvalue()
{
  return " - ";
}

function VeljtishevVmax()
{
    zondObj.resetData();
    var res = zondObj.oprHmaxVFastV(obj.getStationData(),0);
    if (!isValidNum(res)) { return "Метод не работает с заданными значениями параметров"; }
    return res;
}
function VeljtishevH()
{
  var res = zondObj.oprHmaxVFastH(obj.getStationData(),0);
    if (!isValidNum(res)) { return "Метод не работает с заданными значениями параметров"; }
    return res;
}

function VeljtishevH1()
{
  var res = zondObj.oprHmaxVFastH1(obj.getStationData());
    if (!isValidNum(res)) { return "Метод не работает с заданными значениями параметров"; }
    return res;
}

function VeljtishevH2()
{
  var res = zondObj.oprHmaxVFastH2(obj.getStationData());
    if (!isValidNum(res)) { return "Метод не работает с заданными значениями параметров"; }
    return res;
}

function VeljtishevDeltaH(H,H1,H2)
{
    if (!isValidNum(H) ||
        !isValidNum(H1)||
        !isValidNum(H2))
    {
        return "Метод не работает с заданными значениями параметров";
    }

    var d1 = H2-H;
    var d2 = H-H1;
    var delta = d1-d2;
    return delta;
}

function VeljtishevSize(H1,H2)
{
    if (!isValidNum(H1) ||
        !isValidNum(H2))
    {
        return "Метод не работает с заданными значениями параметров";
    }
    var delta = H2-H1;
    return delta;
}

function oprVeljtishevVRes(HSloy,ff_max)
{
  //HSloy - толщина слоя
    if (!isValidNum(HSloy) ||
        !isValidNum(ff_max))
    {
        return "Метод не работает с заданными значениями параметров";
    }
    var poprAlex=0.;
    var k;
    var vrem_goda = true; // TODO лето - перенести в комбо для выбора пользователем? или авторасчет
    if(vrem_goda) {
      if(ff_max<40.||ff_max>260.) {/*inStr="Прогноза скорости нет, т.к V_max вне интервала [40,260] км/ч";return true;*/ return badvalue();}
      if(HSloy>8.) {/*inStr="Вертикальная протяжёность слоя более 8 км";return true;*/ return badvalue();}
      poprAlex = zondObj.pic(pic9_20b_x,pic9_20b_y,pic9_20b_z,ff_max, HSloy);
      if (!isValidNum(poprAlex)) { return "Метод не работает с заданными значениями параметров"; }
    }
    else {
      if(ff_max<20.||ff_max>240.) {/*inStr="Прогноза скорости нет, т.к V_max вне интервала [20,240] км/ч";return true;*/ return badvalue();}
      if(HSloy>8.) {/*inStr="Вертикальная протяжёность слоя более 8 км";return true;*/ return badvalue();}
      poprAlex = zondObj.pic(pic9_20a_x,pic9_20a_y,pic9_20a_z,ff_max, HSloy);
      if (!isValidNum(poprAlex)) { return "Метод не работает с заданными значениями параметров"; }
    }
    k=poprAlex+parseFloat(ff_max);
    dataObj.savePrognoz(obj.getStationData(),name(),title(),hours(), 11040, k.toFixed(2),k.toFixed(2), 0,200);

    return k;
}

function oprVeljtishevHRes(H,deltaH,ff_max)
{
// deltaH - разница между слоями
// H - толщина слоя
    if (!isValidNum(H) ||
        !isValidNum(deltaH) ||
        !isValidNum(ff_max))
    {
        return "Метод не работает с заданными значениями параметров";
    }
    var poprAlex=0.;
    var vrem_goda = true;// TODO лето, перенести в комбо или автоматический расчет
    var k;
    if(ff_max<60.||ff_max>240.) {/*"Прогноза высоты нет, т.к. V_max вне интервала [60,240] км/ч";*/return badvalue(); }
    if(deltaH<-5.||deltaH>5.) {/*"Разница толщин слоев вне интервала [-5,5] км";return true;*/ return badvalue(); }
    if(vrem_goda)
    {
      poprAlex = zondObj.pic(pic9_19b_x,pic9_19b_y,pic9_19b_z,ff_max, deltaH);
      if (!isValidNum(poprAlex)) { return "Метод не работает с заданными значениями параметров"; }
    }
    else
    {
      poprAlex = zondObj.pic(pic9_19a_x,pic9_19a_y,pic9_19a_z,ff_max, deltaH);
      if (!isValidNum(poprAlex)) { return "Метод не работает с заданными значениями параметров"; }
    }
    k=poprAlex+parseFloat(H);

    return k;
}
