
function name(){
  return "LowHightGO"
}

function icon()
{
  return ":/meteo/icons/geopixmap/oblachnost.png";
}

function title(){
  return "Высота верхней и нижней границы облачных слоев";
}

function times(){ //сроки запуска метода, час - время, за которое будет осуществляться отбор исходных данных для прогнозирования
  return "0;12";
}

function hours(){ //период действия прогноза (отсчитывается от times)
  return "0;6";
}

function methodHelpFile()
{
  return "vnvgo.htm";
}

function typeYavl()
{
  return "3";
}

function init(haveUi){
  new TForecastLowHightGO(haveUi);
}

function TForecastLowHightGO(haveUi){
  var h;
  h = new TForecastHeader(haveUi, title());this.initSrc(h);obj.reset();

}

TForecastLowHightGO.prototype.initSrc = function(h) {

  h.parent("1000 гПа","1000hpa");
  h.add("Высота уровня 1000 гПа","hh",1000,100);

  h.parent("950 гПа","950hpa");
  h.add("Высота уровня 950 гПа, м","hh",950,100);
  h.add("Температура на уровне 950 гПа,°C","T",950,100);
  h.add("Дефицит точки росы на уровне 950 гПа,°C","D",950,100);
  h.add("Температура точки росы на уровне 950 гПа,°C","Td",950,100);

  h.parent("900 гПа","900hpa");
  h.add("Высота уровня 900 гПа, м","hh",900,100);
  h.add("Температура на уровне 900 гПа,°C","T",900,100);
  h.add("Дефицит точки росы на уровне 900 гПа,°C","D",900,100);
  h.add("Температура точки росы на уровне 900 гПа,°C","Td",900,100);

    h.parent("850 гПа","850hpa");
     h.add("Высота уровня 850 гПа, м","hh",850,100);
     h.add("Температура на уровне 850 гПа,°C","T",850,100);
     h.add("Дефицит точки росы на уровне 850 гПа,°C","D",850,100);
     h.add("Температура точки росы на уровне 850 гПа,°C","Td",850,100);
  h.parent("800 гПа","800hpa");
    h.add("Высота уровня 800 гПа, м","hh",800,100);
    h.add("Температура на уровне 800 гПа,°C","T",800,100);
     h.add("Дефицит точки росы на уровне 800 гПа,°C","D",800,100);
    h.add("Температура точки росы на уровне 800 гПа,°C","Td",800,100);
  h.parent("750 гПа","750hpa");
    h.add("Высота уровня 750 гПа, м","hh",750,100);
    h.add("Температура на уровне 750 гПа,°C","T",750,100);
    h.add("Дефицит точки росы на уровне 750 гПа,°C","D",750,100);
    h.add("Температура точки росы на уровне 750 гПа,°C","Td",750,100);
  h.parent("700 гПа","700hpa");
    h.add("Высота уровня 700 гПа, м","hh",700,100);
    h.add("Температура на уровне 700 гПа,°C","T",700,100);
    h.add("Дефицит точки росы на уровне 700 гПа,°C","D",700,100);
    h.add("Температура точки росы на уровне 700 гПа,°C","Td",700,100);
  h.parent("650 гПа","650hpa");
  h.add("Высота уровня 650 гПа, м","hh",650,100);
  h.add("Температура на уровне 650 гПа,°C","T",650,100);
  h.add("Дефицит точки росы на уровне 650 гПа,°C","D",650,100);
    h.add("Температура точки росы на уровне 650 гПа,°C","Td",650,100);
  h.parent("600 гПа","600hpa");
  h.add("Высота уровня 600 гПа, м","hh",600,100);
  h.add("Температура на уровне 600 гПа,°C","T",600,100);
  h.add("Дефицит точки росы на уровне 600 гПа,°C","D",600,100);
    h.add("Температура точки росы на уровне 600 гПа,°C","Td",600,100);
  h.parent("550 гПа","550hpa");
  h.add("Высота уровня 550 гПа, м","hh",550,100);
  h.add("Температура на уровне 550 гПа,°C","T",550,100);
  h.add("Дефицит точки росы на уровне 550 гПа,°C","D",550,100);
    h.add("Температура точки росы на уровне 550 гПа,°C","Td",550,100);
  h.parent("500 гПа","500hpa");
  h.add("Высота уровня 500 гПа, м","hh",500,100);
  h.add("Температура на уровне 500 гПа,°C","T",500,100);
  h.add("Дефицит точки росы на уровне 500 гПа,°C","D",500,100);
    h.add("Температура точки росы на уровне 500 гПа,°C","Td",500,100);
  h.parent("450 гПа","450hpa");
  h.add("Высота уровня 450 гПа, м","hh",450,100);
  h.add("Температура на уровне 450 гПа,°C","T",450,100);
  h.add("Дефицит точки росы на уровне 450 гПа,°C","D",450,100);
    h.add("Температура точки росы на уровне 450 гПа,°C","Td",450,100);
  h.parent("400 гПа","400hpa");
  h.add("Высота уровня 400 гПа, м","hh",400,100);
  h.add("Температура на уровне 400 гПа","T",400,100);
  h.add("Дефицит точки росы на уровне 400 гПа","D",400,100);
  h.parent("350 гПа","350hpa");
  h.add("Высота уровня 350 гПа, м","hh",350,100);
  h.add("Температура на уровне 350 гПа,°C","T",350,100);
  h.add("Дефицит точки росы на уровне 350 гПа,°C","D",350,100);
    h.add("Температура точки росы на уровне 350 гПа,°C","Td",350,100);
  h.parent("300 гПа","300hpa");
  h.add("Высота уровня 300 гПа, м","hh",300,100);
  h.add("Температура на уровне 300 гПа,°C","T",300,100);
  h.add("Дефицит точки росы на уровне 300 гПа,°C","D",300,100);
    h.add("Температура точки росы на уровне 300 гПа,°C","Td",300,100);
  h.parent("250 гПа","250hpa");
  h.add("Высота уровня 250 гПа, м","hh",250,100);
  h.add("Температура на уровне 250 гПа,°C","T",250,100);
  h.add("Дефицит точки росы на уровне 250 гПа,°C","D",250,100);
    h.add("Температура точки росы на уровне 250 гПа,°C","Td",250,100);
  h.parent("200 гПа","200hpa");
  h.add("Высота уровня 200 гПа, м","hh",200,100);
  h.add("Температура на уровне 200 гПа,°C","T",200,100);
  h.add("Дефицит точки росы на уровне 200 гПа,°C","D",200,100);
  h.parent("150 гПа","150hpa");
      h.add("Высота уровня 150 гПа, м","hh",150,100);
      h.add("Температура на уровне 150 гПа,°C","T",150,100);
      h.add("Дефицит точки росы на уровне 150 гПа,°C","D",150,100);
      h.add("Температура точки росы на уровне 150 гПа,°C","Td",150,100);
  h.parent("100 гПа","100hpa");
      h.add("Высота уровня 100 гПа, м","hh",100,100);
      h.add("Температура на уровне 100 гПа,°C","T",100,100);
      h.add("Дефицит точки росы на уровне 100 гПа,°C","D",100,100);
      h.add("Температура точки росы на уровне 100 гПа,°C","Td",100,100);

    h.addResultFunction("Высота верхней и нижней границы облачности",
                        "vnvgoV",950,"950hpa.T","950hpa.Td","950hpa.D","1000hpa.hh","950hpa.hh");
    h.addResultFunction("Высота верхней и нижней границы облачности",
                        "vnvgoV",900,"900hpa.T","900hpa.Td","900hpa.D","950hpa.hh","900hpa.hh");
    h.addResultFunction("Высота верхней и нижней границы облачности",
                        "vnvgoV",850,"850hpa.T","850hpa.Td","850hpa.D","900hpa.hh","850hpa.hh");
    h.addResultFunction("Высота верхней и нижней границы облачности",
                        "vnvgoV",800,"800hpa.T","800hpa.Td","800hpa.D","850hpa.hh","800hpa.hh");
    h.addResultFunction("Высота верхней и нижней границы облачности",
                        "vnvgoV",750,"750hpa.T","750hpa.Td","750hpa.D","800hpa.hh","750hpa.hh");
    h.addResultFunction("Высота верхней и нижней границы облачности",
                        "vnvgoV",700,"700hpa.T","700hpa.Td","700hpa.D","750hpa.hh","700hpa.hh");
    h.addResultFunction("Высота верхней и нижней границы облачности",
                        "vnvgoV",650,"650hpa.T","650hpa.Td","650hpa.D","700hpa.hh","650hpa.hh");
    h.addResultFunction("Высота верхней и нижней границы облачности",
                        "vnvgoV",600,"600hpa.T","600hpa.Td","600hpa.D","650hpa.hh","600hpa.hh");
    h.addResultFunction("Высота верхней и нижней границы облачности",
                        "vnvgoV",550,"550hpa.T","550hpa.Td","550hpa.D","600hpa.hh","550hpa.hh");
    h.addResultFunction("Высота верхней и нижней границы облачности",
                        "vnvgoV",500,"500hpa.T","500hpa.Td","500hpa.D","550hpa.hh","500hpa.hh");
    h.addResultFunction("Высота верхней и нижней границы облачности",
                        "vnvgoV",450,"450hpa.T","450hpa.Td","450hpa.D","500hpa.hh","450hpa.hh");
    h.addResultFunction("Высота верхней и нижней границы облачности",
                        "vnvgoV",400,"400hpa.T","400hpa.Td","400hpa.D","450hpa.hh","400hpa.hh");
    h.addResultFunction("Высота верхней и нижней границы облачности",
                        "vnvgoV",350,"350hpa.T","350hpa.Td","350hpa.D","400hpa.hh","350hpa.hh");
    h.addResultFunction("Высота верхней и нижней границы облачности",
                        "vnvgoV",300,"300hpa.T","300hpa.Td","300hpa.D","350hpa.hh","300hpa.hh");
    h.addResultFunction("Высота верхней и нижней границы облачности",
                        "vnvgoV",250,"250hpa.T","250hpa.Td","250hpa.D","300hpa.hh","250hpa.hh");
    h.addResultFunction("Высота верхней и нижней границы облачности",
                        "vnvgoV",200,"200hpa.T","200hpa.Td","200hpa.D","250hpa.hh","200hpa.hh");
    h.addResultFunction("Высота верхней и нижней границы облачности",
                        "vnvgoV",150,"150hpa.T","150hpa.Td","150hpa.D","200hpa.hh","150hpa.hh");
    h.addResultFunction("Высота верхней и нижней границы облачности",
                        "vnvgoV",100,"100hpa.T","100hpa.Td","100hpa.D","150hpa.hh","100hpa.hh");



}
