function name(){
  return "Pochv"
}

function icon()
{
  return ":/meteo/icons/geopixmap/shovel-and-ground.png";
}

function title(){
  return "Оценивание увлажнения и состояния грунта";
}

function times(){ //сроки запуска метода, час - время, за которое будет осуществляться отбор исходных данных для прогнозирования
  return "0;12";
}

function hours(){ //период действия прогноза (отсчитывается от times)
  return "0;6";
}

function methodHelpFile()
{
  return "UvlGrunt.htm";
}

function typeYavl()
{
  return "7";
}

function init(haveUi){
    new TForecastPochv(haveUi);
}

function TForecastPochv(haveUi){
  var h;
  h = new TForecastHeader(haveUi, title());this.initSrc(h);obj.reset();

}

TForecastPochv.prototype.initSrc = function(h) {

    h.addCombo("Вид грунта","tip","Супесь;Суглинок;Глина");
    h.addCombo("Тип грунта","tip2","Легкая;Тяжелая");



    h.addSimple("Количество осадков за последние 12 ч (R1)", "r1",0);
    h.addSimple("Количество осадков за предпоследние 12ч (R2)", "r2",0);
    h.add("Количество осадков 2 суток назад", "R24",0,1,-24);


  h.parent("Осадки за предшествующие 3-5 сутки","3-5");
    h.add("Количество осадков 3 суток назад", "R24",0,1,-48);
    h.add("Количество осадков 4 суток назад", "R24",0,1,-24*3);
    h.add("Количество осадков 5 суток назад", "R24",0,1,-24*4);
    h.addFunction("Сумма осадков за предшествующие 3-5 сутки, мм","R4","R24","r4-2","r4-3");


  h.parent("Осадки за предшествующие 6-10 сутки","6-10");
    h.add("Количество осадков 6 суток назад", "R24",0,1,-5*24);
    h.add("Количество осадков 7 суток назад", "R24",0,1,-6*24);
    h.add("Количество осадков 8 суток назад", "R24",0,1,-7*24);
    h.add("Количество осадков 9 суток назад", "R24",0,1,-8*24);
    h.add("Количество осадков 10 суток назад", "R24",0,1,-9*24);
    h.addFunction("Сумма осадков за предшествующие 6-10 сутки, мм","R5","R24","r5-2","r5-3","r5-4","r5-5");


  h.parent("Осадки за предшествующие 11-20 сутки","11-20");
    h.add("Количество осадков 11 суток назад", "R24",0,1,-10*24);
    h.add("Количество осадков 12 суток назад", "R24",0,1,-11*24);
    h.add("Количество осадков 13 суток назад", "R24",0,1,-12*24);
    h.add("Количество осадков 14 суток назад", "R24",0,1,-13*24);
    h.add("Количество осадков 15 суток назад", "R24",0,1,-14*24);
    h.add("Количество осадков 16 суток назад", "R24",0,1,-15*24);
    h.add("Количество осадков 17 суток назад", "R24",0,1,-16*24);
    h.add("Количество осадков 18 суток назад", "R24",0,1,-17*24);
    h.add("Количество осадков 19 суток назад", "R24",0,1,-18*24);
    h.add("Количество осадков 20 суток назад", "R24",0,1,-19*24);
    h.addFunction("Количество осадков за предшествующие 11-20 сутки, мм","Rbig","R24","r6-2","r6-3","r6-4","r6-5","r6-6","r6-7","r6-8","r6-9","r6-10");

  h.parent("Осадки за предшествующие 21-30 сутки","21-30");
    h.add("Количество осадков 21 сутки назад", "R24",0,1,-20*24);
    h.add("Количество осадков 22 сутки назад", "R24",0,1,-21*24);
    h.add("Количество осадков 23 сутки назад", "R24",0,1,-22*24);
    h.add("Количество осадков 24 сутки назад", "R24",0,1,-23*24);
    h.add("Количество осадков 25 сутки назад", "R24",0,1,-24*24);
    h.add("Количество осадков 26 сутки назад", "R24",0,1,-25*24);
    h.add("Количество осадков 27 сутки назад", "R24",0,1,-26*24);
    h.add("Количество осадков 28 сутки назад", "R24",0,1,-27*24);
    h.add("Количество осадков 29 сутки назад", "R24",0,1,-28*24);
    h.add("Количество осадков 30 сутки назад", "R24",0,1,-29*24);
    h.addFunction("Количество осадков за предшествующие 21-30 сутки, мм","Rbig","К24","r7-2","r7-3","r7-4","r7-5","r7-6","r7-7","r7-8","r7-9","r7-10");


  h.parent("Осадки за предшествующие 31-40 сутки","31-40");
    h.add("Количество осадков 31 сутки назад", "R24",0,1,-30*24);
    h.add("Количество осадков 32 суток назад", "R24",0,1,-31*24);
    h.add("Количество осадков 33 суток назад", "R24",0,1,-32*24);
    h.add("Количество осадков 34 суток назад", "R24",0,1,-33*24);
    h.add("Количество осадков 35 суток назад", "R24",0,1,-34*24);
    h.add("Количество осадков 36 суток назад", "R24",0,1,-35*24);
    h.add("Количество осадков 37 суток назад", "R24",0,1,-36*24);
    h.add("Количество осадков 38 суток назад", "R24",0,1,-37*24);
    h.add("Количество осадков 39 суток назад", "R24",0,1,-38*24);
    h.add("Количество осадков 40 суток назад", "R24",0,1,-39*24);
    h.addFunction("Количество осадков за предшествующие 31-40 сутки, мм","Rbig","R24","r8-2","r8-3","r8-4","r8-5","r8-6","r8-7","r8-8","r8-9","r8-10");
  h.parent("Осадки за предшествующие 41-50 сутки","41-50");
    h.add("Количество осадков 41 сутки назад", "R24",0,1,-40*24);
    h.add("Количество осадков 42 суток назад", "R24",0,1,-41*24);
    h.add("Количество осадков 43 суток назад", "R24",0,1,-42*24);
    h.add("Количество осадков 44 суток назад", "R24",0,1,-43*24);
    h.add("Количество осадков 45 суток назад", "R24",0,1,-44*24);
    h.add("Количество осадков 46 суток назад", "R24",0,1,-45*24);
    h.add("Количество осадков 47 суток назад", "R24",0,1,-46*24);
    h.add("Количество осадков 48 суток назад", "R24",0,1,-47*24);
    h.add("Количество осадков 49 суток назад", "R24",0,1,-48*24);
    h.add("Количество осадков 50 суток назад", "R24",0,1,-49*24);
    h.addFunction("Количество осадков за предшествующие 41-50 сутки, мм","Rbig","R24","r9-2","r9-3","r9-4","r9-5","r9-6","r9-7","r9-8","r9-9","r9-10");

  h.parent("Осадки за предшествующие 51-60 сутки","51-60");
    h.add("Количество осадков 51 сутки назад", "R24",0,1,-50*24);
    h.add("Количество осадков 52 суток назад", "R24",0,1,-51*24);
    h.add("Количество осадков 53 суток назад", "R24",0,1,-52*24);
    h.add("Количество осадков 54 суток назад", "R24",0,1,-53*24);
    h.add("Количество осадков 55 суток назад", "R24",0,1,-54*24);
    h.add("Количество осадков 56 суток назад", "R24",0,1,-55*24);
    h.add("Количество осадков 57 суток назад", "R24",0,1,-56*24);
    h.add("Количество осадков 58 суток назад", "R24",0,1,-57*24);
    h.add("Количество осадков 59 суток назад", "R24",0,1,-58*24);
    h.add("Количество осадков 60 суток назад", "R24",0,1,-59*24);
    h.addFunction("Количество осадков за предшествующие 51-60 сутки, мм","Rbig","R24","r10-2","r10-3","r10-4","r10-5","r10-6","r10-7","r10-8","r10-9","r10-10");

//    uvlag(val,tip,weight,R1,R2,R3,R4,R5,R6,R7,R8,R9,R10)
    h.addResultFunction("Относительная влажность грунта","uvlag",1,"Pochv.tip","Pochv.tip2","Pochv.r1",
                        "Pochv.r2","Pochv.r3","Pochv.3-5.R4","Pochv.6-10.R5","Pochv.11-20.Rbig","Pochv.21-30.Rbig","Pochv.31-40.Rbig","Pochv.41-50.Rbig","Pochv.51-60.Rbig");
    h.addResultFunction("Степень увлажнения грунта","uvlag",2,"Pochv.tip","Pochv.tip2","Pochv.r1",
                        "Pochv.r2","Pochv.r3","Pochv.3-5.R4","Pochv.6-10.R5","Pochv.11-20.Rbig","Pochv.21-30.Rbig","Pochv.31-40.Rbig","Pochv.41-50.Rbig","Pochv.51-60.Rbig");
    h.addResultFunction("Состояние грунта","uvlag",3,"Pochv.tip","Pochv.tip2","Pochv.r1",
                        "Pochv.r2","Pochv.r3","Pochv.3-5.R4","Pochv.6-10.R5","Pochv.11-20.Rbig","Pochv.21-30.Rbig","Pochv.31-40.Rbig","Pochv.41-50.Rbig","Pochv.51-60.Rbig");





}
